Revit 2027 API
ParametersOrder Enumeration
 The order of the parameters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ParametersOrder
Public Enumeration ParametersOrder
public enum class ParametersOrder
type ParametersOrder
Members
Member name | Value | Description
Ascending | 0 |  Sort parameters are in ascending(A-Z) order.
Descending | 1 |  Sort parameters are in descending(Z-A) order.
See Also
Reference
Autodesk.Revit.DB Namespace